{
  "type_mappings": {
    "Software and Configuration Checks": ["AC-3", "AC-6", "SI-2"],
    "Vulnerabilities": ["RA-5", "SI-2", "SI-3"],
    "Effects": ["SI-4", "SI-5"],
    "Software and Configuration Checks/Industry and Regulatory Standards": [
      "CM-2",
      "CM-6",
      "CM-7"
    ],
    "Sensitive Data Identifications": ["SC-8", "SC-28", "MP-4"],
    "Network Reachability": ["SC-7", "AC-4", "AC-17"],
    "Unusual Behaviors": ["SI-4", "AU-6"],
    "Policy": ["PL-1", "CA-1", "CM-1"],
    "TTPs": ["RA-3", "PM-15", "PM-16"],
    "Data Protection": ["MP-2", "MP-3", "MP-4", "MP-5", "MP-6", "MP-7"],
    "Compliance": ["CM-6", "CA-2", "CA-7"],
    "Defense Evasion": ["SI-3", "SI-4", "SI-10"],
    "Persistence": ["AC-3", "AC-6", "IA-2"],
    "Privilege Escalation": ["AC-6", "AC-2", "IA-4"],
    "Credential Access": ["IA-2", "IA-5", "IA-7"],
    "Discovery": ["CM-8", "RA-5", "SI-4"],
    "Lateral Movement": ["AC-4", "SC-7", "SC-5"],
    "Collection": ["AU-12", "SI-4", "IR-4"],
    "Command and Control": ["SC-7", "SC-5", "IR-4"],
    "Exfiltration": ["SC-7", "AC-4", "SI-4"],
    "Impact": ["CP-2", "CP-10", "IR-4"],
    "Initial Access": ["AC-17", "AC-3", "IA-2"],
    "Execution": ["CM-7", "AC-3", "SI-3"]
  },
  "title_mappings": {
    "password": ["IA-5", "AC-7"],
    "encryption": ["SC-13", "SC-28"],
    "access": ["AC-3", "AC-6"],
    "permission": ["AC-2", "AC-6"],
    "exposed": ["SC-7", "AC-3"],
    "public": ["SC-7", "AC-3"],
    "patch": ["SI-2", "CM-8"],
    "update": ["SI-2", "CM-3"],
    "backup": ["CP-9", "CP-10"],
    "logging": ["AU-2", "AU-6"],
    "monitor": ["AU-6", "SI-4"],
    "authentication": ["IA-2", "IA-5", "IA-8"],
    "authorization": ["AC-2", "AC-3", "AC-6"],
    "credentials": ["IA-5", "IA-4", "AC-3"],
    "audit": ["AU-2", "AU-3", "AU-6", "AU-7", "AU-9", "AU-12"],
    "configuration": ["CM-2", "CM-3", "CM-6", "CM-7"],
    "network": ["AC-4", "SC-7", "SC-8"],
    "security": ["PL-2", "PM-2", "SI-4"],
    "vulnerability": ["RA-3", "RA-5", "SI-2"],
    "risk": ["RA-2", "RA-3", "PM-9"],
    "incident": ["IR-2", "IR-4", "IR-6", "IR-8"],
    "continuity": ["CP-2", "CP-7", "CP-9", "CP-10"],
    "media": ["MP-2", "MP-3", "MP-4", "MP-6"],
    "physical": ["PE-2", "PE-3", "PE-5", "PE-6"],
    "personnel": ["PS-2", "PS-3", "PS-4", "PS-5"],
    "awareness": ["AT-2", "AT-3", "AT-4"],
    "training": ["AT-2", "AT-3", "AT-4"]
  },
  "control_descriptions": {
    "AC-2": "Account Management - The organization manages information system accounts, including establishing, activating, modifying, reviewing, disabling, and removing accounts.",
    "AC-3": "Access Enforcement - The system enforces approved authorizations for logical access to information and system resources.",
    "AC-4": "Information Flow Enforcement - The system enforces approved authorizations for controlling the flow of information within the system and between connected systems.",
    "AC-6": "Least Privilege - The principle that users and programs should have only the minimum privileges necessary to complete their tasks.",
    "AC-7": "Unsuccessful Logon Attempts - The system enforces limits on consecutive invalid logon attempts by a user.",
    "AC-17": "Remote Access - Establishes and manages remote access sessions.",
    "AC-18": "Wireless Access - The organization establishes usage restrictions, configuration requirements, and implementation guidance for wireless access.",
    "AC-19": "Access Control for Mobile Devices - The organization establishes usage restrictions, configuration requirements, and implementation guidance for mobile devices.",
    "AC-20": "Use of External Information Systems - The organization establishes terms and conditions for external systems to process, store, or transmit organizational information.",
    "AU-2": "Audit Events - The organization determines the types of events that the system will audit.",
    "AU-3": "Content of Audit Records - The system generates audit records containing information that establishes what type of event occurred.",
    "AU-6": "Audit Review, Analysis, and Reporting - The organization reviews and analyzes system audit records for indications of inappropriate activity.",
    "AU-8": "Time Stamps - The system uses internal system clocks to generate time stamps for audit records.",
    "AU-9": "Protection of Audit Information - The system protects audit information and audit tools from unauthorized access, modification, and deletion.",
    "AU-12": "Audit Generation - The system provides audit record generation capability and generates audit records.",
    "CA-1": "Security Assessment and Authorization Policies and Procedures - The organization develops policies and procedures for security assessment and authorization.",
    "CA-2": "Security Assessments - The organization conducts security control assessments.",
    "CA-7": "Continuous Monitoring - The organization develops a security assessment and authorization program.",
    "CA-8": "Penetration Testing - The organization conducts penetration testing on systems or system components.",
    "CM-1": "Configuration Management Policy and Procedures - The organization develops policies and procedures for configuration management.",
    "CM-2": "Baseline Configuration - The organization develops and maintains baseline configurations for information systems.",
    "CM-3": "Configuration Change Control - The organization manages and documents changes to the system.",
    "CM-6": "Configuration Settings - The organization establishes and enforces security configuration settings.",
    "CM-7": "Least Functionality - The organization configures systems to provide only essential capabilities.",
    "CM-8": "Information System Component Inventory - The organization develops and maintains an inventory of system components.",
    "CP-2": "Contingency Plan - The organization develops a contingency plan for the system.",
    "CP-7": "Alternate Processing Site - The organization establishes an alternate processing site.",
    "CP-9": "Information System Backup - The organization conducts backups of user-level and system-level information.",
    "CP-10": "Information System Recovery and Reconstitution - The organization provides for recovery and reconstitution of the system to a known state.",
    "IA-2": "Identification and Authentication (Organizational Users) - The information system uniquely identifies and authenticates organizational users.",
    "IA-3": "Device Identification and Authentication - The system uniquely identifies and authenticates devices.",
    "IA-4": "Identifier Management - The organization manages system identifiers.",
    "IA-5": "Authenticator Management - The organization manages system authenticators (e.g., passwords, tokens, biometrics).",
    "IA-8": "Identification and Authentication (Non-Organizational Users) - The system uniquely identifies and authenticates non-organizational users.",
    "IR-4": "Incident Handling - The organization implements an incident handling capability.",
    "IR-5": "Incident Monitoring - The organization tracks and documents information system security incidents.",
    "IR-6": "Incident Reporting - The organization requires personnel to report suspected security incidents.",
    "IR-8": "Incident Response Plan - Documents the organization's incident response processes and procedures.",
    "MP-2": "Media Access - The organization restricts access to digital and non-digital media.",
    "MP-3": "Media Marking - The organization marks system media.",
    "MP-4": "Media Storage - The organization physically controls and securely stores media within controlled areas.",
    "MP-5": "Media Transport - The organization protects and controls media during transport.",
    "MP-6": "Media Sanitization - The organization sanitizes system media before disposal or release for reuse.",
    "PE-2": "Physical Access Authorizations - The organization develops, approves, and maintains lists of individuals with authorized access to the facility.",
    "PE-3": "Physical Access Control - The organization enforces physical access authorizations and controls entry to facilities.",
    "PL-1": "Security Planning Policy and Procedures - The organization develops, documents, and disseminates security planning policy and procedures.",
    "PL-2": "System Security Plan - The organization develops a security plan for the system.",
    "PM-2": "Senior Information Security Officer - The organization appoints a senior information security officer.",
    "PM-9": "Risk Management Strategy - The organization develops a comprehensive strategy to manage risk.",
    "RA-3": "Risk Assessment - The organization conducts risk assessments.",
    "RA-5": "Vulnerability Scanning - The organization scans for vulnerabilities in the system and applications.",
    "SA-3": "System Development Life Cycle - The organization manages the system using a system development life cycle.",
    "SA-4": "Acquisition Process - The organization includes security requirements in acquisition contracts.",
    "SA-5": "Information System Documentation - The organization obtains documentation for the system.",
    "SA-9": "External Information System Services - The organization requires service providers to comply with organizational security requirements.",
    "SA-11": "Developer Security Testing and Evaluation - The organization requires developers to create a security assessment plan.",
    "SC-5": "Denial of Service Protection - Protects against or limits the effects of DoS attacks.",
    "SC-7": "Boundary Protection - The system monitors and controls communications at external boundaries and key internal boundaries.",
    "SC-8": "Transmission Confidentiality and Integrity - The system protects the confidentiality and integrity of transmitted information.",
    "SC-10": "Network Disconnect - The system terminates the network connection associated with a user session after a defined period of inactivity.",
    "SC-13": "Cryptographic Protection - The system implements cryptographic mechanisms to protect information.",
    "SC-28": "Protection of Information at Rest - The system protects the confidentiality and integrity of information at rest.",
    "SC-39": "Process Isolation - The system maintains a separate execution domain for each executing process.",
    "SI-2": "Flaw Remediation - The organization identifies, reports, and corrects system flaws.",
    "SI-3": "Malicious Code Protection - The system implements malicious code protection mechanisms.",
    "SI-4": "Information System Monitoring - The organization monitors the system to detect attacks and potential indicators of compromise.",
    "SI-5": "Security Alerts, Advisories, and Directives - The organization receives security alerts and advisories and takes appropriate actions.",
    "SI-7": "Software, Firmware, and Information Integrity - The system implements mechanisms to detect unauthorized changes.",
    "SI-10": "Information Input Validation - The system checks the validity of information inputs.",
    "SI-13": "Predictable Failure Prevention - The system provides alert capability for impending system component failures."
  }
}
